/*************************************************************************//**
*****************************************************************************
* @file   fs/entry.c
* The file contains:
*   - do_enter_dir_entry()
*   - do_back_dir_entry()
*   - do_new_dir_entry()
*   - do_delete_dir_entry()
*   - do_move_dir_entry()
*****************************************************************************
*****************************************************************************/

#include "type.h"
#include "stdio.h"
#include "const.h"
#include "protect.h"
#include "string.h"
#include "fs.h"
#include "proc.h"
#include "tty.h"
#include "console.h"
#include "global.h"
#include "keyboard.h"
#include "proto.h"

PRIVATE void new_dir_entry(struct inode * dir_inode, int inode_nr, char * filename);

/*****************************************************************************
*                               do_enter_dir_entry()
*****************************************************************************/
/**
* 进入一个子目录并展示其全部子项
*
* @返回bool值代表成功或者失败
*****************************************************************************/

PUBLIC int do_enter_dir_entry()
{
	char *pathname;
	char *filename;
	int name_len;
	struct inode * dir_inode;
	pathname = fs_msg.PATHNAME;
	name_len = fs_msg.NAME_LEN;

	if (strip_path(filename, pathname, &dir_inode) == 0)
		return false;
	//输出全部子项名称
	printl();

	return true;
}

/*****************************************************************************
*                               do_back_dir_entry()
*****************************************************************************/
/**
* 返回一个父目录并展示其全部子项
*
* @返回bool值代表成功或者失败
*****************************************************************************/

PUBLIC int do_back_dir_entry()
{

}

/*****************************************************************************
*                               do_new_dir_entry()
*****************************************************************************/
/**
* 建立一个子目录
*
* @返回bool值代表成功或者失败
*****************************************************************************/

PUBLIC int do_new_dir_entry()
{

}

/*****************************************************************************
*                               do_delete_dir_entry()
*****************************************************************************/
/**
* 删除一个子目录以及其下全部子项
*
* @返回bool值代表成功或者失败
*****************************************************************************/

PUBLIC int do_delete_dir_entry()
{

}

/*****************************************************************************
*                               do_move_dir_entry()
*****************************************************************************/
/**
* 将子目录进行移动至指定目录下
*
* @返回bool值代表成功或者失败
*****************************************************************************/

PUBLIC int do_move_dir_entry()
{

}